backend/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'test@gmail.com' LIMIT 1
---
    def self.find_by_credentials(email, password)
        user = User.find_by(email: email)

SELECT 1 AS one FROM "users" WHERE "users"."session_token" = 'plQqY7-AwRF5oPbeSYql0w' LIMIT 1
---
    def generate_session_token
        while true
            token = SecureRandom.urlsafe_base64
            return token unless User.exists?(session_token: token)