backend/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."session_token" = 'VDN3gf2W4mPTetgezIssFg' LIMIT 1
---
  def current_user
    @current_user ||= User.find_by(session_token: session[:session_token])