backend/app/controllers/api/tickets_controller.rb

    def index
        if current_user.role == "staff"
            @tickets = Ticket.all
        else
            @tickets = Ticket.where(creator_id: current_user.id)
---
SELECT "tickets".* FROM "tickets"
SELECT "tickets".* FROM "tickets" WHERE "tickets"."creator_id" = 3

    def show
        @ticket = Ticket.find_by(id: params[:id])
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = 73 LIMIT 1

    def create

        @ticket = Ticket.new(ticket_params);
        @ticket.creator_id = current_user.id

        if @ticket.save
---
INSERT INTO "tickets" ("category", "created_at", "creator_id", "description", "status", "title", "updated_at", "priority") VALUES ('Access', '2025-12-14 04:55:39.837875', 48, 'Sad Please Help', 'Open', 'Cannot Log into SAAS', '2025-12-14 04:55:39.837875', 'medium') RETURNING "id"

    def update
        @ticket = Ticket.find_by(id: params[:id])
        if !@ticket
            return render json: {message: 'Failed to find ticket'}, status: :unauthorized
        end

        if current_user.role != "staff" && @ticket.creator_id != current_user.id
            return render json: {message: 'Unauthorized'}, status: :unauthorized
        end

        if params[:assignee_ids]
            @ticket.assignees = User.where(id: params[:assignee_ids] || []).where(role: "staff")
        end

        if @ticket.update(ticket_params)
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = 73 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" IN (47, 46, 51, 50)
UPDATE "tickets" SET "status" = 'Closed', "updated_at" = '2025-12-14 05:32:44.083748' WHERE "tickets"."id" = 75