backend/app/controllers/api/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."role" = 'staff'
---
    def index
        @users = User.all.where(role: "staff")

SELECT "users".* FROM "users" WHERE "users"."id" = 35 LIMIT 1
---
    def show
        @user = User.find(params[:id])